[
    {
        "id": "spiderbot_done",
        "title": "SpiderBot",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/spiderbot/cover.JPG",
        "description": "The Project SpiderBot initiative aims to construct a hexapod robot capable of multi-terrain navigation, applying advanced locomotion algorithms and robotic perception for practical applications in diverse environments.",
        "github": "https://github.com/ERC-BPGC/SpiderBot",
        "team_leads": [
            { "name": "Garv Gupta" },
            { "name": "Adarsh Gopalakrishnan" },
            { "name": "Akshat Tubki" }
            
        ]
    },
    {
        "id": "vulcan_done",
        "title": "Vulcan",
        "category": "ongoing",
        "type": "research",
        "image": "/images/projects/vulcan/cover.JPG",
        "description": "Fully humanoid robots that can replicate humans is quite an advanced research topic in the field of robotics. Vulcan is our attempt of building a humanoid, with the aim of replicating human-like features such as blinking, making eye contact with the person speaking and mouth movement while 'speaking'. The project covers multiple technologies ranging from OpenCV to natural language processing methods to achieve this. Since building a full humanoid is quite complex and expensive, this will serve as a great launchpad for those that want to work with humanoid robots in the future. While starting from a base point which was the facial structure, we are now working towards interacting with real world objects via a bionic arm which will serve to further Vulcan's progress in the field of humanoid robotics.",
        "github": "https://github.com/ERC-BPGC/project-vulcan",
        "team_leads": [
            { "name": "Aryan Goyal" },
            { "name": "Kevin Mathew" },
            { "name": "Parth Shah" },
            { "name": "Ritwik Sharma" },
            { "name": "Sharvil Potdar" }
        ]
    },
    {
        "id": "snakebot_done",
        "title": "SnakeBot",
        "category": "ongoing",
        "type": "research",
        "image": "/images/projects/snakebot/cover.JPG",
        "description": "Snakebot is a modular, wheel-less snake robot in which each segment operates independently with onboard control and power. The current design implements 2-DOF motion using a virtual rolling joint driven by 2 servos. A six-segment version has been successfully assembled and tested, demonstrating basic locomotion patterns such as caterpillar . Future work focuses on enabling advanced snake gaits, including serpentine and sidewinding motion, and enhancing friction control for improved terrain adaptability.",
        "github": "https://github.com/ERC-BPGC/SnakeBot",
        "team_leads": [
            { "name": "Dev Thacker" },
            { "name": "Nilesh Bhatia" },
            { "name": "Harsh Jain" },
            { "name": "Hritik Joglekar" }
        ]
    },
    {
        "id": "quadruped_done",
        "title": "Quadruped",
        "category": "ongoing",
        "type": "research",
        "image": "/images/projects/quadruped/cover.png",
        "description": "Project Quadruped aims to develop an advanced quadruped robot designed for autonomous site documentation and surveying in challenging environments, such as construction sites and disaster areas. Inspired by Boston Dynamics, 'Spot', the robot features four robotic legs, each with three degrees of freedom (3-DOF), allowing it to traverse uneven terrain, climb stairs, and maneuver over obstacles with ease. This versatility makes it ideal for environments where traditional wheeled robots may struggle.",
        "github": "https://github.com/ERC-BPGC/quadruped",
        "team_leads": [
            { "name": "Saransh Agrawal" },
            { "name": "Ritwik Sharma" },
            { "name": "Snigdha Semwal" }
        ]
    },
    {
        "id": "swarm-drones_done",
        "title": "Swarm Drones",
        "category": "ongoing",
        "type": "research",
        "image": "",
        "description": "This ongoing project is focused on the development of a mother child drone architecture, where a primary drone transports and deploys multiple child drones into indoor environments for autonomous exploration. The child drones are being developed to perform multi-agent ToF-based scanning and mapping, supported by swarm algorithms for coordination, communication, and data fusion. System behavior and scalability are being continuously validated using ROS 2 with Aerostack2 simulations. In parallel, a custom ESP32-based child drone platform is being designed to replace Crazyflie, enabling full low level control and flexible integration of ToF sensors and additional onboard processors.",
        "github": "https://github.com/ERC-BPGC/",
        "team_leads": [
            { "name": "Indrajit Mandal" },
            { "name": "Omkar Shrikant" }
        ]
    },
    {
        "id": "drone-automation",
        "title": "Drone Automation",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/drone-auto/cover.JPG",
        "description": "Making an Autonomous Drone with a goal to catch a moving obstacle like a tennis ball.",
        "github": "https://github.com/ERC-BPGC/",
        "team_leads": [
            { "name": "Nayan Gogari" }
        ]
    },
    {
        "id": "embedded-systems",
        "title": "Embedded Systems",
        "category": "ongoing",
        "type": "research",
        "image": "",
        "description": "",
        "github": "https://github.com/ERC-BPGC/",
        "team_leads": [
            { "name": "Yash Kamat" },
            { "name": "Soumyaditya Nandy"}
        ]
    },
    {
        "id": "robotic-arm-v2_done",
        "title": "Robotic Arm v2",
        "category": "ongoing",
        "type": "research",
        "image": "/images/projects/robotic-arm/cover.JPG",
        "description": "This project explores the structured development of robotic manipulators, progressing from a custom 3-DOF robotic arm to a 6-DOF MOVEO manipulator, and currently to SO-ARM 100-based systems as a modular test platform. The work emphasizes mechanical and actuator design, kinematic and dynamic modeling, embedded control, and system integration, with the long-term objective of realizing a fully custom, in-house fabricated 6-DOF dual-arm robotic system. The platform is intended for robotic manipulation research and control algorithm experimentation.",
        "github": "https://github.com/ERC-BPGC/RoboticArm",
        "team_leads": [
            { "name": "Sudhanshu Kulkarni" },
            { "name": "Ayush Tiwari" },
            { "name": "Ansh Parmeshwar" }
        ]
    },
    {
        "id": "robotic-arm-3dof_done",
        "title": "Robotic Arm (3 DoF)",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/3dof - arm/cover.png",
        "description": "This project aims to design and manufacture a robust robotic arm integrated with a reliable perception and control system that will enable it to perform simple as well as intelligent tasks with high precision and repeatability. The immediate aim of the project is to design and assemble a five-degree of freedom (DOF) robotic arm with forwarding and inverse kinematic control. Along with the capability of autonomous operation and object detection, which as a whole allows it to perform pick and place operations on objects within the workspace, including playing chess against human players.",
        "github": "https://github.com/ERC-BPGC/RoboticArm",
        "team_leads": [
            { "name": "Ninaad Kotasthane" }
        ]
    },
    {
        "id": "air-hockey_done",
        "title": "Air Hockey",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/air-hockey/cover.png",
        "description": "Originally conceptualized for Quark '24, this project features a fully autonomous air hockey robot built on custom, in-house hardware. The system utilizes a robust, stepper-motor actuated gantry and a single-camera computer vision setup to track game states in real-time. To control the paddle, we implemented and benchmarked three distinct algorithms: an Imitation Learning agent (a Keras DNN trained on video data extracted from an expert mobile game), a Reinforcement Learning (RL) model for adaptive strategy, and a conventional physics engine for mathematical trajectory prediction. This multi-model approach allows us to test classical control theory against modern AI techniques on a rigorous physical platform.",
        "github": "https://github.com/Maker-Rat/Air_Hockey_RL",
        "team_leads": [
            { "name": "Saransh Agrawal" },
            { "name": "Ritwik Sharma" }
        ]
    },
    {
        "id": "carborone_done",
        "title": "Carborone",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/carborone/cover.jpeg",
        "description": "This project aims to Create a model of Autonomous drone car. Which can analyse the environment and take decisions using OpenCV and decide whether to move on the ground or fly to avoid an obstacle and decide its own trajectory. It's main aim is to improve the applications of a car on the ground so that it could travel to even the most difficult places than it would be possible for a normal car. We also aim to have a power efficient version of drone car that can fly for longer durations and make it more accessible by safely going to different locations.",
        "github": "https://github.com/4825vinay/Project-Carborone",
        "team_leads": [
            { "name": "Vinay Sabarad" }
        ]
    },
    {
        "id": "swarmbots-2_done",
        "title": "SwarmBots 2.0",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/swarmbots-2/cover.jpg",
        "description": "Swarm robotics is an approach to the coordinated behaviour of multi-robot systems. A swarm robotic system comprises a group of simple robots equipped with basic algorithms, sensors, and actuators. However, these bots are collectively able to carry out complex tasks. The project aims to build a swarm of autonomous mobile robots and implement various 'collective decision-making' algorithms on this swarm. The project will serve as a platform for various swarm-robotics-related applications in the future. It is intended to also explore and eventually implement multi-agent learning based methods, inspired by classical swarm algorithms.",
        "github": "https://github.com/ERC-BPGC/swarm_bots",
        "team_leads": [
            { "name": "Arjun Puthli" }
        ]
    },
    {
        "id": "trotbot_done",
        "title": "Trotbot",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/trotbot/cover.jpg",
        "description": "Trotbot is a multipurpose omni-directional robot, designed to serve autonomously in indoor/semi-indoor environments. It can be used to deliver packages from one location to another in offices, construction sites, buildings etc. It can also be teleoperated to nearby locations using the camera feed for surveillance and mapping. The robot will be able to autonomously navigate around obstacles and reach waypoints set in and around the environment with the use of onboard sensors and be able to detect it's location. Currently, we are looking at visual inertial odometry for robust localization in indoor environments.",
        "github": "https://github.com/ERC-BPGC/Trotbot",
        "team_leads": [
            { "name": "Vishnu Rajgopal" },
            { "name": "Shantanu Deshmukh" }
        ]
    },
    {
        "id": "acoustic-camera_done",
        "title": "Acoustic Camera",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/acoustic-camera/cover.jpg",
        "description": "An acoustic camera is an imaging device used to locate sound sources. It uses multiple microphones and advanced acoustic signal processing algorithms to accomplish this task. Our goal is to create a low-cost acoustic camera that could be used in applications such as noise reduction in machinery and aerodynamic surfaces.",
        "github": "https://github.com/ERC-BPGC/echoslam_ROS",
        "team_leads": [
            { "name": "Tanay Patni" },
            { "name": "Sahil Shingote" }
        ]
    },
    {
        "id": "gennav_done",
        "title": "GenNav",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/gennav/cover.png",
        "description": "Gennav aims to create a general purpose python library that can be used for path planning in various robotics settings. It will have a collection of path planning algorithms, motion controllers along with various utilities to handle different methods of path optimisation, environment representation and eventually a geometry module to handle the underlying computations. Currently focused on the 2D path planning aspect of navigation. Rather than writing a big new python file for each new path planning algorithm, we could build on already defined utilities and primitives. This would be a big help to anyone working on any robot with autonomous navigation capabilities in the future. All they would need to do is implement the robot specific code and use gennav for the planning, control and optimization heavy lifting.",
        "github": "https://github.com/ERC-BPGC/gennav",
        "team_leads": [
            { "name": "Atharv Sonwane" }
        ]
    },
    {
        "id": "quadruped-bhaagwati_done",
        "title": "Quadruped a.k.a. Bhaagwati",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/quadruped-bhaagwati/cover.png",
        "description": "The main objective is to mimic a four legged animal and get various gaits out of it like trot, bound, canter through open loop and closed loop methods. It will be further used as a platform for attachment of vision based system for mapping different terrains. We have successfully deployed trotting walk on the quadruped. A ROS (Robot Operating System) package is also created. A static self-stabilizing PID controller using an IMU has been created and successfully deployed on the quadruped. Different gaits will be tested on the quadruped. A dynamic stabilizing strategy will be developed. Later, environment tracking using realsense depth camera will be developed.",
        "github": "https://github.com/MohitGupta007/Quadruped_BPGC",
        "team_leads": [
            { "name": "Mohit Gupta" }
        ]
    },
    {
        "id": "modbot_done",
        "title": "Modbot",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/modbot/cover.jpeg",
        "description": "Modular Robots are a system of individual modules capable of linking to each other to form reconfigurable structures suited for different purposes. Using this method, a single system can be used for a wide range of applications. This is useful when the task/environment of a bot is not known beforehand. The project aimed to design, simulate and manufacture such modules with maximum DOFs possible for a highly flexible and robust system. A single module was manufactured capable of teleoperation. An Arduino Nano and an ESP32 were used to control the input to the respective motors.",
        "github": "https://github.com/rmvanarse/modbot2",
        "team_leads": [
            { "name": "Prathmesh Thorwe" }
        ]
    },
    {
        "id": "swarmbots_done",
        "title": "Swarmbots",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/swarmbots/cover.png",
        "description": "Swarm robotics is an approach to coordinate multiple robots as a system, which consists of large numbers of mostly simple physical robots. The project aimed at the task to automate a decentralized swarm of autonomous mobile robots to carry out different tasks. The bots do not communicate with each other, and perform tasks through 'collective decision making' algorithms. Multiple simulations have been created to perform tasks such as line formation, circle formation, etc. Along with this evaluation metrics were attached to each task to monitor the quality.",
        "github": "https://github.com/rmvanarse/swarm_tasks",
        "team_leads": [
            { "name": "Rishikesh Vanarse" }
        ]
    },
    {
        "id": "sketcher_done",
        "title": "Sketcher",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/sketcher/cover.jpeg",
        "description": "Sketcher was one of the display projects displayed in Quark 2020 by the ERC. It is basically a full-scale prototype of a polargraph - a fully automated drawing machine capable of rendering one image into multiple artistic forms on paper. It supports multiple drawing styles such as stipples, travelling salesperson, D2S etc.",
        "github": "https://github.com/ERC-BPGC/Sketcher",
        "team_leads": []
    },
    {
        "id": "led-hexapad_done",
        "title": "LED Hexapad",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/led-hexapad/cover.jpeg",
        "description": "The LED Hexapad was an interactive display piece for Quark 2020. At its heart it is a MIDI controller with six touch sensitive pads, that can trigger a wide range of virtual instruments on a computer. In addition to this, each hexagonally shaped pad is illuminated by NeoPixel LEDs which show dynamic animations that react to human touch.",
        "github": "https://github.com/ERC-BPGC/LED-Octapad",
        "team_leads": []
    },
    {
        "id": "led-globe_done",
        "title": "LED Globe",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/led-globe/cover.jpeg",
        "description": "LED Globe was the flagship display project from ERC for Quark 2019, the technical fest of BITS-Goa. The globe consisted of two 75 cm radius acrylic semicircular discs having LEDs along the perimeter of one of them. This setup was mounted vertically on an aluminium frame. The setup would be rotated using a high torque motor. The synchronised firing of LEDs created the illusion of an image. The programming that was involved allowed one to take any image from the internet, divide it into a number of segments which the code could recognize and thus program the LEDs in that manner.",
        "github": "https://github.com/ERC-BPGC/LED_Globe",
        "team_leads": [
            { "name": "Mohit Gupta" }
        ]
    },
    {
        "id": "ball-drone_done",
        "title": "Ball-Drone",
        "category": "completed",
        "type": "research",
        "image": "/images/projects/ball-drone/cover.png",
        "description": "Ball drone is a 'uni-rotor' VTOL drone that is maneuvered using four control surfaces. The drone is capable of performing all the tasks done by a conventional quadcopter using less power. The spherical shell also helps in protecting the inner hardware and rotating propeller from any immediate threat. The spherical shell will be 3D printed and the flight controller will be made with an ESP32 microcontroller and a MPU 9250. A CAD model and a simulator of the drone on Simscape multibody is made.",
        "github": "",
        "team_leads": [
            { "name": "Cheriyan Homey" }
        ]
    },
    {
        "id": "klann_done",
        "title": "Klann",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/klann/cover.jpeg",
        "description": "Klann was one of the display projects displayed in Quark 2020 by the ERC. The eight-legged walking bot was based on the Klann linkage, a planar mechanism designed to simulate the gait of a legged animal and function as a wheel replacement.",
        "github": "",
        "team_leads": []
    },
    {
        "id": "8bit-computer_done",
        "title": "8 Bit Computer",
        "category": "completed",
        "type": "mini",
        "image": "/images/projects/8bit/8bit.JPG",
        "description": "A fully functional 8-bit computer built from scratch using Integrated Circuits, demonstrating fundamental computer architecture principles.",
        "github": "",
        "team_leads": [
            { "name": "Dev Thacker" },
            { "name": "Harsh Gupta" }
        ]
    },
    {
        "id": "desktop-companion-bot_done",
        "title": "Desktop Companion Bot",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A small interactive desktop robot companion designed to assist and entertain users with various programmed behaviors and responses.",
        "github": "https://github.com/ERC-BPGC/Desktop-Companion-Bot",
        "team_leads": [
            {"name": "Saransh Agrawal"},
            {"name": "Nilesh Bhatia"},
            {"name": "Aryan Goyal"},
            {"name": "Parth Jaju"},
            {"name": "Dev Thacker"},
            {"name": "Kevin Mathew"}
        ]
    },
    {
        "id": "stewart-platform",
        "title": "Stewart Platform",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A parallel manipulator platform with six degrees of freedom, commonly used for motion simulation and precision positioning applications.",
        "github": "https://github.com/ERC-BPGC/Stewart-Platform",
        "team_leads": [
            {"name": "Yash Kamat"}
        ]
    },
    {
        "id": "cubli_done",
        "title": "Cubli",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A self-balancing cube robot that can balance on its corner and edges using reaction wheels and advanced control algorithms.",
        "github": "https://github.com/ERC-BPGC/Cubli",
        "team_leads": [
            {"name": "Dev Thacker"},
            {"name": "Nilesh Bhatia"},
            {"name": "Khayik Champawat"},
            {"name": "Arshika Sharma"}
        ]
    },
    {
        "id": "single-inverted-pendulum_done",
        "title": "Single Inverted Pendulum",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A classic control systems project demonstrating the stabilization and balancing of a single inverted pendulum using multiple control strategies, including PID, LQR, and MPC. The project focused on modeling the pendulum dynamics, designing and tuning controllers, and comparing their performance in maintaining upright equilibrium under disturbances.",
        "github": "https://github.com/ERC-BPGC/Single_Inverted_Pendulum",
        "team_leads": [
            {"name": "Parth Jaju"}
        ]
    },
    {
        "id": "tars_done",
        "title": "Tars",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A miniature replica of TARS from the movie Interstellar that mimics it's locomotion and speech capabilities keeping it's 'sarcasm' in mind",
        "github": "https://github.com/bodsvei/TARS_Quark-25",
        "team_leads": [
            {"name": "Kevin Mathew"},
            {"name": "Yash Vijay"},
            {"name": "Nathan Sequeira"}
        ]
    },
    {
        "id": "lasor-projector",
        "title": "Lasor Projector",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "",
        "github": "",
        "team_leads": [
            {"name": "Suryansh Singh"},
            {"name": "Advait Anand Kelkar"}
        ]
    },
    {
        "id": "automated-orchestra_done",
        "title": "Automated Orchestra",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "An automated musical system that works as an add-on to conventional instruments, enabling them to be played autonomously through robotic actuation and intelligent control, thereby creating synchronized orchestral performances without human performers.",
        "github": "https://github.com/ERC-BPGC/Auto-Orchestra",
        "team_leads": [
            {"name": "Sudhanshu Kulkarni"}
        ]
    },
    {
        "id": "automated-dart-board_done",
        "title": "Automated Dart Board",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "In this project we created a low-cost, marker-based motion capture system specifically created for an automated bullseye dartboard. The system was built using modified PS3 Eye cameras enhanced for infrared sensitivity, enabling precise, real time tracking of IR reflective markers. Our solution included meticulous intrinsic and extrinsic calibration processes, ensuring millimeter level accuracy while remaining cost effective. On the mechanical side, the system employed a gantry based mechanism driven by six NEMA stepper motors to achieve precise belt based motion control.",
        "github": "https://github.com/ERC-BPGC/Auto-Dart-Board",
        "team_leads": [
            {"name": "Yashvardhan Mote"},
            {"name": "Omkar Shrikant"},
            {"name": "Ranadip Chakraborty"},
            {"name": "Sudhanshu Kulkarni"},
            {"name": "Aadit"}
        ]
    },
    {
        "id": "led-matrix_done",
        "title": "LED Matrix",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A programmable LED matrix display capable of showing animations, text, and graphics through custom programming.",
        "github": "https://github.com/ERC-BPGC/LED_Matrix",
        "team_leads": [
            {"name": "Dev Thacker"}
        ]
    },
    {
        "id": "swarm-minions_done",
        "title": "Swarm Minions",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A group of small coordinated robots that work together using swarm intelligence algorithms to accomplish tasks collectively.",
        "github": "https://github.com/ERC-BPGC/Swarm-Minions",
        "team_leads": [
            {"name": "Aryan Goyal"},
            {"name": "Indrajit Mandal"},
            {"name": "Devansh Dusad"},
            {"name": "Harikrishnan"}
        ]
    },
    {
        "id": "maze-solver_done",
        "title": "Maze Solver",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "An autonomous robot capable of navigating and solving mazes using sensors and pathfinding algorithms.",
        "github": "https://github.com/ERC-BPGC/Maze_Solver",
        "team_leads": [
            {"name": "Pranav Saxena"},
            {"name": "Ajinkya Deshpande"}
        ]
    },
    {
        "id": "wall-e_done",
        "title": "WALL-E",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A replica of the beloved Pixar robot WALL-E, featuring expressive movements and interactive behaviors.",
        "github": "https://github.com/ERC-BPGC/WALL-E",
        "team_leads": [
            {"name": "Parth Shah"}
        ]
    },
    {
        "id": "bb8-droid_done",
        "title": "BB8 Droid",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A replica of the Star Wars BB-8 droid, featuring the signature ball-based movement and head balancing mechanism.",
        "github": "https://github.com/ERC-BPGC/BB8_Droid",
        "team_leads": [
            {"name": "Sharvil Potdar"},
            {"name": "Chirag"}
        ]
    },
    {
        "id": "strikebot_done",
        "title": "Strikebot",
        "category": "completed",
        "type": "mini",
        "image": "",
        "description": "A combat-style robot designed for competitive robotics battles with offensive and defensive capabilities.",
        "github": "https://github.com/ERC-BPGC/strikeBot",
        "team_leads": []
    }
]
